Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_assistance_payments/social_assistance_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Social assistance in Ireland
ga: Cúnamh sóisialach in Éirinn

source: Social assistance payments are for people who do not have enough PRSI contributions to qualify for the equivalent social insurance payments
ga: Íoctar íocaíochtaí cúnaimh shóisialaigh le daoine nach bhfuil a ndóthain ranníocaíochtaí árachais shóisialaigh (ÁSPC) le cáiliú do na híocaíochtaí árachais shóisialaigh

source: An example would be a person who becomes unemployed, applies for Jobseeker's Benefit but fails to qualify because he or she has insufficient PRSI contributions
ga: Mar shampla de sin, cuir i gcás duine atá nua-dífhostaithe ag cur isteach ar Shochar Cuardaitheora Poist, ní cháileoidh sé don sochar mar níl a d(h)óthain ranníocaíochtaí ÁSPC aige/aici

source: He or she can instead apply for Jobseeker's Allowance, which is a similar payment but is not based on the number of PRSI contributions paid
ga: Is féidir leis/léi cur isteach ar Liúntas Cuardaitheora Poist, íocaíocht atá cosúil leis an Shochar Cuardaitheora Poist ach nach bhfuil bunaithe ar na ranníocaíochtaí

source: Jobseeker's Benefit is a social insurance payment but Jobseeker's Allowance is a social assistance payment
ga: Is íocaíocht árachais shóisialaigh é Shochar Cuardaitheora Poist ach is íocaíocht chúnaimh shóisialaigh é Liúntas Cuardaitheora Poist

source: However, to get a social assistance payment you must be habitually resident in Ireland and you must pass a means test
ga: Ní mór duit gnáthchónaí a bheith agat in Éirinn agus ní mór duit tástáil acmhainne a shásamh le cáiliú do na híocaíochtaí cúnaimh shóisialaigh

source: The rules governing social welfare assistance payments are set out in legislation and/or administrative guidelines
ga: Tá rialacha ag baint le híocaíochtaí leasa shóisialaigh agus tá siad leagtha síos i reachtaíocht agus/nó i dtreoirlínte riaracháin

source: Most of the guidelines are now available on the Department of Social Protection's (DSP) website
ga: Tá an chuid is mó de na treoirlínte ar fáil anois ar láithreán gréasáin na Roinne Coimirce Sóisialaí

source: In general you cannot get two social assistance payments (except for Carer's Allowance which can be paid at a half rate with another social welfare payment)
ga: Go ginearálta ní féidir dhá íocaíocht cúnaimh shóisialaigh a fháil (seachas Liúntas Cúramóra a d’fhéadfadh bheith iníoctha ar leath-ráta) le híocaíocht leasa shóisialaigh eile

source: If you think you might qualify for more than one payment, you generally have to choose the one that is of most benefit to you
ga: Má cheapann tú go bhfuil tú i dteideal níos mó ná íocaíocht amháin a fháil, go ginearálta beidh ort an ceann is tairbhí duit a roghnú

source: There are a number of social assistance payments
ga: Tá réimse íocaíochtaí cúnaimh shóisialaigh ann

source: You may qualify for one depending on your circumstances:
ga: Féadann tú bheith i dteideal ceann acu a fháil, braitheann sé ar do chúinsí pearsanta

source: Jobseeker's Allowance is paid to people aged 18 or over and unemployed
ga: Íoctar an Liúntas Cuardaitheora Poist le daoine 18 mbliana d'aois nó os a cionn atá dífhostaithe

source: One-Parent Family Payment (OFP) is paid to men and women who are bringing children up without the support of a partner
ga: Íocaíocht is ea Íocaíocht Teaghlaigh Aontuismitheora do mhná agus fir atá ag tógáil clainne ina n-aonar

source: Farm Assist is an income support scheme for farmers
ga: Is scéim tacaíochta ioncaim í an Cúnamh Feirme d'fheirmeoirí

source: You do not need to be available for work to qualify for Farm Assist
ga: Ní gá duit a bheith ar fáil i gcomhair fostaíochta le cáiliú do Chúnamh Feirme

source: Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension is paid to widows, widowers and surviving civil partners who do not have dependent children
ga: Tá an Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach) do bhaintreacha , baintreacha fir agus páirtnéirí sibhialta marthanacha nach bhfuil páistí cleithiúnacha acu

source: Guardian's Payment (Non-Contributory) is paid to an orphan's guardian up to the orphan's 18th birthday or 22nd birthday if he or she is in full-time education
ga: Íoctar an Íocaíocht Chaomhnóra (Neamhranníocach) le caomhnóir linbh go dtí go slánóidh an leanbh an 18 mbliana nó go dtí go slánóidh sé/sí an 22 bliain má tá sí/sí in oideachas lánaimseartha

source: Carer's Allowance is paid to people who are looking after someone who is in need of full-time care and attention because of age, physical or learning disability or illness, including mental illness
ga: Íoctar an Liúntas Cúramóra le daoine a dhéanann cúram baile de dhuine a bhfuil cúnamh lánaimseartha de dhíth air/uirthi mar gheall ar aois, míchumais fhisiciúla nó intinne lena áirítear tinneas intinne

source: Supplementary Welfare Allowance is paid to people that have no little or no income
ga: Íoctar an Liúntas Leasa Forlíontach le daoine atá ar ísealioncam nó gan ioncam

source: State Pension (Non-Contributory) is paid to people when they reach 66 years of age
ga: Íoctar an Pinsean Stáit (Neamhranníocach) do dhaoine a bhfuil 66 bliana d'aois nó níos mó slánaithe acu

source: Blind Pension is paid to blind and visually impaired people
ga: Íoctar Pinsean na nDall le daoine atá dall nó atá faoi mhíchumas súl

source: Disability Allowance is paid to people with a disability who are aged 16 or over and under age 66
ga: Íocaíocht is ea an Liúntas Míchumais do dhaoine atá faoi mhíchumas agus atá idir 16 agus 66 bliana d'aois

source: Pre-Retirement Allowance (PRETA) is paid to people aged 55 and over who have left the labour force
ga: Íocaíocht is ea an Liúntas Réamhscoir (PRETA) do dhaoine 55 bliana d'aois nó os a cionn atá éirithe as an bhfórsa saothair

source: This scheme was closed to new applications in July 2007
ga: Dúnadh an scéim seo d'iarratais nua in 2007

source: Deserted Wife's Allowance is paid to women who were deserted by their husband and have no dependent children
ga: Íocaíocht is ea Liúntas Banchéile Thréigthe do mhná atá tréigthe ag a bhfear agus nach bhfuil leanaí cleithiúnacha acu

source: This scheme was closed to new applications in January 1997
ga: Dúnadh an scéim seo d'iarratais nua in Eanáir 1997

source: If you qualify for a social assistance payment you may qualify for additional social welfare benefits
ga: Má cháilíonn tú d'íocaíocht leasa shóisialaigh, féadann tú cáiliú chun sochair bhreise leasa shóisialaigh a fháil

source: For most social assistance payments, decisions about your entitlement are made by Deciding Officers
ga: Don chuid is mó íocaíochtaí cúnaimh shóisialaigh, is iad na hOifigigh Bhreithiúnacha a dhéanann an cinneadh cé atá i dteideal íocaíochta

source: Deciding Officers are DSP officials appointed under the social welfare legislation
ga: Is oifigigh leasa shóisialaigh iad na hOifigigh Bhreithiúnacha atá ceaptha faoi reachtaíocht leasa shóisialaigh

source: If you are not happy with a decision by the Department of Social Protection, you have a right to appeal decisions in relation to payments that are based in legislation
ga: Má tá tú míshásta le cinneadh a dhéanann an Roinn Coimirce Sóisialaí, tá sé de rogha agat achomharc a lorg in aghaidh cinntí ar íocaíochtaí atá bunaithe i reachtaíocht

source: Appeals are made to the Social Welfare Appeals Office, an independent statutory body
ga: Déantar achomhairc leis an Oifig Achomhairc Leasa Shóisialaigh, eagraíocht neamhspleách reachtúil

source: Find out how to appeal a decision of the Department of Social Protection
ga: Faigh amach anseo conas achomharc a lorg ón Roinn Coimirce Sóisialaí

source: Rates of payment and dependants
ga: Rátaí íocaíochtaí agus cleithiúnaithe

source: Social welfare payments are divided into a payment for you, the claimant, known as the personal rate of payment, and a payment for any adult dependants and child dependants
ga: Tá íocaíochtaí leasa shóisialaigh roinnte in íocaíochtaí don éilitheoir, ar a dtugtar an ráta pearsanta íocaíochta agus íocaíochtaí ar son aon chleithiúnaithe ar dhaoine fásta iad nó cleithiúnaithe ar leanaí iad

source: The SW 19 Rates of Payment Booklet, published by the Department of Social Protection every year, details the amount of money payable for each scheme and the amount that will be awarded to your dependants
ga: Foilsíonn an Roinn Coimirce Sóisilaí Leabhrán um Rátaí Íocaíochta SW 19 gach bliain agus tá sonraí le fáil ann maidir le méid an airgid iníoctha faoi gach scéim agus méid an airgid atá iníoctha do chleithiúnaithe an éilitheora

source: If you wish to apply for a social welfare payment, you should contact your Intreo Centre or Social Welfare Branch Office or Citizens Information Centre for an application form and an information leaflet
ga: Más mian leat iarratas a dhéanamh ar íocaíocht leasa shóisialaigh ar leith, ba cheart duit teagmháil a dhéanamh le d'Ionad Intreo nó d'Oifig Bhrainse Leasa Shóisialaigh nó le hIonad Faisnéise do Shaoránaigh le foirm iarratais agus bileog faisnéise a fháil

source: Fill out the correct application form and return it to the Department of Social Protection
ga: Líon isteach an fhoirm iarratais cheart agus cuir ar ais í chuig an Roinn Coimirce Sóisialaí

source: The return address is printed on the application form
ga: Tá an seoladh fillte foilsithe ar chúl na foirme iarratais
